articles/media.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-29 Mon 12:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thoughts on Media</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
<link rel="shortcut icon" type="image/jpg" href="./favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Thoughts on Media</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org43983ac">Media Thoughts</a>
<ul>
<li><a href="#orge53b1cd">Books</a>
<ul>
<li><a href="#org392df1a">The Memory Book</a></li>
<li><a href="#org191d49e">Memory Craft by Lynne Kelly</a></li>
<li><a href="#org700a86a">Advanced Memory Palaces by Joe Reddington</a></li>
<li><a href="#orgd70305c">One Hundred Leaves</a></li>
<li><a href="#org6cbbe1a">The Art of Memory by Frances Yates</a></li>
</ul>
</li>
<li><a href="#org58966e7">Anime</a>
<ul>
<li><a href="#orgd12a698">Lycoris Recoil</a></li>
<li><a href="#orgec492d2">Death Note</a></li>
</ul>
</li>
<li><a href="#org3f4a409">Games</a>
<ul>
<li><a href="#orgc6b0339">Final Fantasy 7 (PSX)</a></li>
<li><a href="#org5351f62">Metal Gear Solid (PSX)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org43983ac" class="outline-1">
<h1 id="org43983ac">Media Thoughts</h1>
<div class="outline-text-1" id="text-org43983ac">
<p>
This is a page where I will collect some shorthand thoughts on stuff I read / watch / consume. I'll often link to full reviews from this page, but I want something a bit centralized in comparison to the links page.
</p>
</div>

<div id="outline-container-orge53b1cd" class="outline-2">
<h2 id="orge53b1cd">Books</h2>
<div class="outline-text-2" id="text-orge53b1cd">
</div>
<div id="outline-container-org392df1a" class="outline-3">
<h3 id="org392df1a">The Memory Book</h3>
<div class="outline-text-3" id="text-org392df1a">
<p>
8/10 Reread this ahead of a brief stint reading about mnemonics. I gave this a high rating as a token of appreciation for being the entry door for me into mnemonics, but the content in this book can easily be condensed into 10 pages at most, and I think online tutorials are likely better in comparison to reading this. Large amounts of this book are dedicated to fluff lists of substitute words for names which were common in the 50s, and applying basic techniques to unusual stuff. This leads to some <a href="https://twitter.com/Ambisinister_/status/1742674217282478481/photo/1">hilarity</a>, but overall it's very easy to read and not a bad introduction.
</p>

<p>
Aside: this book takes a rather inflammatory stance against memory palaces, a view which I consider fairly incorrect after spending a little bit of time on it. 
</p>
</div>
</div>

<div id="outline-container-org191d49e" class="outline-3">
<h3 id="org191d49e">Memory Craft by Lynne Kelly</h3>
<div class="outline-text-3" id="text-org191d49e">
<p>
10/10 See <a href="https://planetbanatt.net/articles/memorycraft.html">Book Review: Memory Craft</a>. Well researched, interesting, with coherent flow of ideas from beginning to end. I teetered on giving this a 10 (it's borderline), but I think the book was too absorbing for me to feel a 9 is justified. Lots here even for those who lack the desire to learn these techniques, more of a pop anthropology book than anything else.
</p>
</div>
</div>

<div id="outline-container-org700a86a" class="outline-3">
<h3 id="org700a86a">Advanced Memory Palaces by Joe Reddington</h3>
<div class="outline-text-3" id="text-org700a86a">
<p>
8/10 Full book review coming soon, requires project.
</p>

<p>
Some good insights in this book about the limitations of memory palaces, the relationship between memory techniques and data structures used in computer science, and experimental techniques created by importing unused concepts from data structures research.
</p>

<p>
The most practically important thing in this book is the idea that memory palaces are just arrays, and that all of them are as such just mapping arbitrary content to an ordered list (in arrays this is usually the list of integers). This alone I think makes the book worth the price of admission, and I think this largely explains away most of the historical gap between <i>real places</i> and <i>ficticious places</i>, especially among people with aphantasia. But as a general computer person I liked most of the content in this book.
</p>
</div>
</div>

<div id="outline-container-orgd70305c" class="outline-3">
<h3 id="orgd70305c">One Hundred Leaves</h3>
<div class="outline-text-3" id="text-orgd70305c">
<p>
7/10 Read this annotated reader of the <i>Hyakunin Isshu</i> since I am kicking around the idea of writing an essay on <i>Chihayafuru</i>. The poems are really beautiful, and it's a lovely collection of poems, but I must admit that the aesthetics of Japanese poetry is really lost in translation for me &#x2013; I think with my rudimentary Japanese I can handle relatively simple wordplay which pops up in anime from time to time, but actual poems are really just a completely different beast; many of these lines often have three or even four readings which completely transform the meaning of the poem, making poetry in Japanese a lot more of an intellectual exercise than it tends to be considered in English speaking countries.
</p>

<p>
I still might write this essay, which would likely involve me actually memorizing these poems for real. That part actually does not seem so bad. At the end of the day Kana was right: deeply understanding the poems is much harder, and potentially much worthier, than just remembering what they say.
</p>
</div>
</div>

<div id="outline-container-org6cbbe1a" class="outline-3">
<h3 id="org6cbbe1a">The Art of Memory by Frances Yates</h3>
<div class="outline-text-3" id="text-org6cbbe1a">
<p>
8/10 A comprehensive and fundamental work about the history of memory techniques. I am really taken aback by how much this body of training represented an occult art throughout the arc of history. This book is certainly the book to get if you're interested in the history of memory techniques, but it lacks the enthusiasm of <i>Memory Craft</i> by comparison. Whereas that work I thought the engagement with various mnemotechnic systems was almost overly gratuitous, in contrast Frances Yates writes from a purely academic viewpoint, completely openly devoid of any interest in learning the craft for herself. As much as I appreciate the history of the art; its origins in occult and religious practice and its downstream influence upon rhetoric, psychology, theology, and history; it was too distracting to be repeatedly confront the idea that someone could have written so many words on this topic and not held even the slightest interest in trying to test it yourself. 
</p>
</div>
</div>
</div>

<div id="outline-container-org58966e7" class="outline-2">
<h2 id="org58966e7">Anime</h2>
<div class="outline-text-2" id="text-org58966e7">
</div>
<div id="outline-container-orgd12a698" class="outline-3">
<h3 id="orgd12a698">Lycoris Recoil</h3>
<div class="outline-text-3" id="text-orgd12a698">
<p>
6.5/10 A show which does not know what it wants to be. Tone shifts do not feel justified and the <a href="https://en.wikipedia.org/wiki/Great_man_theory">great man theory</a> thesis of the show doesn't feel earned. A victim of tell, don't show; overall forgettable through trying to pretend it has more to say than it does.
</p>
</div>
</div>

<div id="outline-container-orgec492d2" class="outline-3">
<h3 id="orgec492d2">Death Note</h3>
<div class="outline-text-3" id="text-orgec492d2">
<p>
9/10 I rewatched Death Note and it's both as good and bad as I remembered it. Death Note, to me, is one of the few bits of media whose importance is actually slightly bolstered by its own flaws. You really get the sense that if the show was written by someone just a little bit smarter, that it would have been more interesting, but I actually think that is explicitly <i>not</i> the case, even if that would have made it much <i>better</i>. Light Yagami being written as a non-genius's mental picture of a genius makes his mistakes jump out and encourages you to roll your own solutions to the already very interesting premise, and the seemingly endless capacity this show has for letting people talk about it is something any anime could benefit from learning from.
</p>

<p>
Overall I think Death Note is a badly written show with an extremely interesting premise, and it's one of those shows which hammers home the unintuitive premise that poorly-written media can be good / well-written media can be bad. This is not the case for the vast majority of cases, but Death Note is a stand out example.
</p>
</div>
</div>
</div>

<div id="outline-container-org3f4a409" class="outline-2">
<h2 id="org3f4a409">Games</h2>
<div class="outline-text-2" id="text-org3f4a409">
</div>
<div id="outline-container-orgc6b0339" class="outline-3">
<h3 id="orgc6b0339">Final Fantasy 7 (PSX)</h3>
<div class="outline-text-3" id="text-orgc6b0339">
<p>
8/10 An ambitious art project which does not have a clear vision for why it is a video game. Beautiful soundtrack and handpainted backgrounds, extremely frustrating to navigate the environment, Classic final fantasy overly high encounter rate, fairly interesting characters, and clumsy dialogue. Willing to look the other way for stuff which can be explained away by localization failure, but too much of the character development feels like one person writing two characters with the same voice.
</p>

<p>
The real star of this game is the cinematic attacks; the summons are all outrageously beautiful and I often felt sad when I had to stop using some of them after obtaining a new one. Lots to be said about the various examples but the one which will stick with me forever is Safer Sephiroth's <i>Supernova</i> which was certainly the most incredible attack that has ever hit me while playing any video game.
</p>

<p>
A lot to be said on the game as a piece of art, but as a video game it did not really work for me &#x2013; I often felt frustrated or annoyed by what was happening on screen, and I felt that it was really more of an opera than a video game. I did not feel this about final fantasy 6, which also had a higher encounter rate: I'm chopping this up to the relative open-endedness, and also perhaps the slightly different tone. Overall I continued to get the sense playing this game that I was playing a good game, but for some reason I found myself daydreaming about the next game I would get to play after completing it.
</p>
</div>
</div>

<div id="outline-container-org5351f62" class="outline-3">
<h3 id="org5351f62">Metal Gear Solid (PSX)</h3>
<div class="outline-text-3" id="text-org5351f62">
<p>
7/10 Impressively overrated. Feel that this game is beloved for how quirky and ridiculous all the dialogue is, which is admittedly charming at times. But it just grew to be too grating after a while, and would regularly interfere with my enjoyment of the game. Extremely confused about the biology in this game: FOXDIE is explained in a stray codec discussion in a genuinely interesting manner which feels scientifically plausible, only for the central plot focus to throw in some nonsense about "dominant genes".
</p>

<p>
The game itself is fairly pedestrian, you're always getting hit by things offscreen or invisible, it's a pain in the neck to play, and you tend to feel like you're just waiting for the next codec rather than enjoying the game. It lives in an interesting middle ground, where it seems to not understand why it is a video game until it's slamming you in the face with metacommentary on being a video game (oooo I can see your saves oooo better switch to player 2). There's things to like about Metal Gear Solid, but generally speaking I think you can just watch the cutscenes on youtube or something.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
<div id="comments">
    <p></p>
    <hr />
       <div id="disqus_thread">
           <script>
(function() {
var d = document, s = d.createElement('script');
s.src = 'https://planetbanatt.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>
</body>
</html>
